# [0:0:0]
# 0 -  Начало строки
# 0 - Конец строки
# 0 - Промежуток строк
#print (str[len(str) // 2:]) из числа делаем слово или слово делим на пополам ВАЖНО! 

example = "Топинамбур" #В переменную example запишите любую строку.
print(example[0]) #Выведите на экран(в консоль) первый символ этой строки.
print(example[-1]) #Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
print(str[len(example) // 2:]) #Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print(example[::-1])#Выведите на экран(в консоль) это слово наоборот.
print(example[1::2])#Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')

#Александров Даниил 30.08.2024
